## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  NAME                                   |
|----------|-------------------------------------------------------------------------|
| update   | `module.rds_activity_stream[0].aws_iam_policy.firehose_activity_stream` |
|          | `module.rds_activity_stream[0].aws_lambda_function.decrypt`             |
| recreate | `module.rds_activity_stream[0].aws_lambda_layer_version.decrypt_deps`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.rds_activity_stream[0].data.aws_iam_policy_document.firehose_activity_stream will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "firehose_activity_stream" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-cluster-activity-5vn01zd2",
              + "arn:aws:s3:::notification-canada-ca-staging-cluster-activity-5vn01zd2/*",
            ]
          + sid       = "S3Write"
        }
      + statement {
          + actions   = [
              + "kinesis:ListStreams",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "KinesisListStreams"
        }
      + statement {
          + actions   = [
              + "kinesis:DescribeStream",
              + "kinesis:DescribeStreamSummary",
              + "kinesis:GetRecords",
              + "kinesis:GetShardIterator",
              + "kinesis:ListShards",
              + "kinesis:ListStreams",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kinesis:ca-central-1:239043911459:stream/aws-rds-das-cluster-UB3YOTSGSXHZFGGZZFFVLBWSWY",
            ]
          + sid       = "KinesisReadDBActivityStream"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:ca-central-1:239043911459:key/4deb0800-619d-4373-971d-1613e19318a3",
            ]
          + sid       = "KMSDecryptDatabaseActivityStream"
        }
      + statement {
          + actions   = [
              + "lambda:GetFunctionConfiguration",
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:239043911459:function:notification-canada-ca-staging-cluster-decrypt-activity",
            ]
          + sid       = "LambdaInvokeDecrypt"
        }
    }

  # module.rds_activity_stream[0].aws_iam_policy.firehose_activity_stream will be updated in-place
  ~ resource "aws_iam_policy" "firehose_activity_stream" {
        id        = "arn:aws:iam::239043911459:policy/notification-canada-ca-staging-cluster-firehose-activity"
        name      = "notification-canada-ca-staging-cluster-firehose-activity"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::notification-canada-ca-staging-cluster-activity-5vn01zd2/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-cluster-activity-5vn01zd2",
                        ]
                      - Sid      = "S3Write"
                    },
                  - {
                      - Action   = "kinesis:ListStreams"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "KinesisListStreams"
                    },
                  - {
                      - Action   = [
                          - "kinesis:ListStreams",
                          - "kinesis:ListShards",
                          - "kinesis:GetShardIterator",
                          - "kinesis:GetRecords",
                          - "kinesis:DescribeStreamSummary",
                          - "kinesis:DescribeStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kinesis:ca-central-1:239043911459:stream/aws-rds-das-cluster-UB3YOTSGSXHZFGGZZFFVLBWSWY"
                      - Sid      = "KinesisReadDBActivityStream"
                    },
                  - {
                      - Action   = "kms:Decrypt"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:239043911459:key/4deb0800-619d-4373-971d-1613e19318a3"
                      - Sid      = "KMSDecryptDatabaseActivityStream"
                    },
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:GetFunctionConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:notification-canada-ca-staging-cluster-decrypt-activity"
                      - Sid      = "LambdaInvokeDecrypt"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.rds_activity_stream[0].aws_lambda_function.decrypt will be updated in-place
  ~ resource "aws_lambda_function" "decrypt" {
        id                             = "notification-canada-ca-staging-cluster-decrypt-activity"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:239043911459:layer:decrypt-deps:5",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.rds_activity_stream[0].aws_lambda_layer_version.decrypt_deps must be replaced
-/+ resource "aws_lambda_layer_version" "decrypt_deps" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:239043911459:layer:decrypt-deps:5" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-04-12T14:58:00.306+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:239043911459:layer:decrypt-deps:5" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:239043911459:layer:decrypt-deps" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "D55KRHsG0HtUi61dO5jB+dbuOEarLzCjTvsyUD/dHsU=" -> "SSI18mlZcufBCaG1zK5pYPzXaG9evu6Cu5WU6nPbEBk=" # forces replacement
      ~ source_code_size            = 18324821 -> (known after apply)
      ~ version                     = "5" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.rds_activity_stream[0].module.activity_stream_bucket.aws_s3_bucket.this,
  on .terraform/modules/rds_activity_stream.activity_stream_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
